// 재귀함수를 이용한 1부터 100까지의 합과 곱

// 재귀함수는 반복문과 다르게 위에서부터 아래로 값이 내려간다.
// 순번    f(n)     n     return         최종
// 1      f(100)   100  100 + f(99)     100+99+98+97+96+95...+2+1
// 2      f(99)     99   99 + f(98)     99+98+97+96+95...+2+1
// 3      f(98)     98   98 + f(97)     98+97+96+95...+2+1
// 4      f(97)     97   97 + f(96)     97+96+95...+2+1
// ...
// 99     f(2)       2    2 + f(1)      2+1
// 100    f(1)       1    1  (리턴값이 자기자신을 호출하지 않음)

function a(n) {
  if (n <= 1) {
    return 1;
  }
  return n + a(n - 1);
}

console.log('a(10): ', a(10));
console.log('a(100): ', a(100));
console.log('a(1000): ', a(1000));

// 재귀함수의 곱
// 순번    f(n)     n     return         최종
// 1       f(6)     6     6 x f(5)      6*5*4*3*2*1
// 2       f(5)     5     5 x f(4)      5*4*3*2*1
// 3       f(4)     4     4 x f(3)      4*3*2*1
// 4       f(3)     3     3 x f(2)      3*2*1
// 5       f(2)     2     2 x f(1)      2*1
// 6       f(1)     1     1             1

function m(n) {
  if (n <= 1) {
    return 1;
  }
  return n * m(n - 1);
}

console.log('m(4)', m(4));
console.log('m(5)', m(5));
console.log('m(6)', m(6));
